app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "This is a an updated post"], ["updated_at", "2015-09-19 13:09:05.822372"], ["id", 4]]
---
def update
	@post = Post.find(params[:id])

	if @post.update(params[:post].permit(:title, :body))